FemDesign.RestrictedString
Contains string restrictions used for property definitions.
Restrictions are defined by strusoft.xsd

FemDesign.RestrictedString.RestrictionItemsMsg(System.Collections.Generic.List{System.String})
Create error message from items.

FemDesign.RestrictedString.RestrictionItems(System.String,System.Collections.Generic.List{System.String})
Check if val in items.

FemDesign.RestrictedString.Length(System.String,System.Int32)
Check if length of val is smaller than len.
val:
len:
Returns:

FemDesign.RestrictedString.EdgeType(System.String)
edgetype

FemDesign.RestrictedString.EurocodeType(System.String)
eurocodetype

FemDesign.RestrictedString.SteelMadeType(System.String)
steelmadetype